case_directory/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField uniform (7.5 0 0);

boundaryField
{
    inlet_patch
    {
        type            fixedValue;
        value           uniform (7.5 0 0);
    }

    outlet_patch
    {
        type            zeroGradient;
    }

    sphere_obstruction
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    boundary_walls
    {
        type            fixedValue;
        value           uniform (7.5 0 0);
    }   
}

// ************************************************************************* //
