case_directory/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    inlet_patch
    {
        type            fixedValue;
        value           uniform 0.375;
    }
    outlet_patch
    {
        type            zeroGradient;
    }

    sphere_obstruction
    {
        type            kqRWallFunction; //TODO: review option
        value           uniform 0.375;
    }

    boundary_walls
    {
        type            fixedValue;
        value           uniform 0.375;
    }
}


// ************************************************************************* //
