case_directory/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet_patch
    {
        type            calculated;
        value           uniform 0;
    }
    outlet_patch
    {
        type            calculated;
        value           uniform 0;
    }
    
    sphere_obstruction
    {
        type            nutkWallFunction; //TODO: review option
        value           uniform 0;
    }

    boundary_walls
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
