case_directory/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 440.15;

boundaryField
{
    inlet_patch
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet_patch
    {
        type            zeroGradient;
    }
    sphere_obstruction
    {
        type            omegaWallFunction; //TODO: review option
        value           uniform 440.15;
    }

    boundary_walls
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
