case_directory/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet_patch
    {
        type            zeroGradient;
    }

    outlet_patch
    {
        type            fixedValue;
        value           uniform 0;
    }

    sphere_obstruction
    {
        type            zeroGradient;
    }

    boundary_walls
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
