case_directory/system/forcesIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates pressure and viscous forces over specified patches for a case
    where the solver is incompressible; i.e., pressure is kinematic and has
    units of m^2/s^2.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/forces/forcesIncompressible.cfg"

patches     (<patchNames>); // Names of patches on which to calculate forces

rhoInf      <rhoInf>;       // Far field density; e.g., 1.225 kg/m^3 for air

CofR        <CofR>;         // Centre of rotation; e.g., (0 0 0)

pitchAxis   <pitchAxis>;    // Pitch axis; e.g., (0 1 0)

// ************************************************************************* //
